{
    "switchToFirefox": "Firefox is a completely free privacy focused web browser made by the nonprofit Mozilla. The browser is made with users' interests at heart and and works to protect your privacy at every turn. For example, Firefox has built in tracking protection which works to prevent sites from tracking you. This is especially important as Google trackers are present on an alarmingly high number of websites (75% of the top million websites have Google trackers!!!). Firefox also has a wide variety of features, such as syncing tabs across devices and a free password manager called Firefox Lockwise. I highly recommend Firefox as it is open source and Mozilla has a proven track record of protecting users. To install it on a pc, Mac, Linux, iOS, or Android, simply search up Firefox or go to ;https://www.mozilla.org/en-US/firefox/new/||mozilla.org;.",
    "switchToSafari": "Safari is a free web browser which is only available on Apple devices. Its pretty fast/lightweight and also has built in tracking protection. As opposed to Firefox, most of Safari is closed source meaning it is much harder for people to understand what its code does. This is still not a bad option for people using Apple devices although I still personally prefer Firefox.",
    "alterChromeConfiguration": "If you are still set on using Chrome, there are still some ways of improving your privacy on the browser. Note, incognito mode doesn’t really do that much except not storing cookies/browser history in those tabs. You can install an extension called Privacy Badger which blocks trackers on websites. Look up Privacy Badger or visit this site for more information on how to install it: ;https://privacybadger.org/||privacybadger.org;.\n\n    You can also change some of your Google privacy settings, this is good in general even if you do not use Chrome. Check it out in ;https://www.fastcompany.com/90350359/7-google-privacy-settings-you-should-revisit-right-now||this article;",
    "alterEdgeConfiguration": "If you are still set on using Edge, there are some ways of improving your privacy on the browser. You can install an extension called Privacy Badger which blocks trackers on websites. Look up Privacy Badger or visit this site for more information on how to install it: ;https://privacybadger.org/||privacybadger.org;.",
    "alterOperaConfiguration": "If you are still set on using Opera, there are some ways of improving your privacy on the browser. You can install an extension called Privacy Badger which blocks trackers on websites. Look up Privacy Badger or visit this site for more information on how to install it: ;https://privacybadger.org/||privacybadger.org;. I would also highly advise against using Opera’s free VPN. If you are looking for a VPN, I would advise the use of a well known “No log” VPN. Examples include, but are not limited to: Mozilla VPN, NordVPN, ExpressVPN, Surfshark, and ProtonVPN. Do some more research to find something which suits your needs but make sure it is a “No Log” VPN.",
    "switchToDuckDuckGo": "DuckDuckGo is my go to search engine. It is a pioneer in online privacy and never tracks its users. To date, DuckDuckGo has served over 71 billion searches! I find DuckDuckGo search results to be great and would advise everyone to at least try it for a week and see if you actually miss your old search engine. I think you will be surprised. To try it out, go to ;https://duckduckgo.com/||duckduckgo.com;. To make the switch, look up how to set a default search engine on the browser you use (this is completely reversible). There is also a mobile app if you are interested.",
    "alterGoogleConfiguration": "If you tried DuckDuckGo, for some reason don’t like it, and still want to use Google, ;https://www.consumerreports.org/privacy/how-to-use-google-privacy-settings/||here is a tutorial on Google privacy settings;. I would highly caution against using Google when possible as its software is very invasive.",
    "alterBingConfiguration": "If you tried DuckDuckGo, don’t like it, and still want to use Bing, you will probably want to stop Bing from storing your search history (if you are signed into Microsoft). To do this you’ll need to visit your Microsoft privacy settings here: ;https://account.microsoft.com/account/privacy||account.microsoft.com/account/privacy;. While you're there, review privacy settings for other Microsoft software that you use.",
    "iosRecommendations":";\bWhile iOS is getting better at protecting privacy, and is definitely better than Google owned Android, there are some settings that need review/changing.;\n\n   Firstly, go into the Settings app, scroll down/search until you see the Privacy tab. From there, you can check which apps have access to what parts of your phone. I would pay special attention to the Location Services tab as that is what allows apps to track your location. Ideally, apps should either be set to \"never\" have location access, \"ask\", or \"while using\". You should almost never have an app set to \"always\" unless there is a genuine reason for doing so.\n\n    Next scroll to the bottom of the Location Services page (also also located in the Privacy section) and tap on the System Services tab. In there, there should be a tab called Significant Locations. It basically creates a history of where you have been. I personally would disable this and clear history. While Apple says that this location history is encrypted, it is not unhackable and could either be accessed through the on device storage or by hacking Apple servers. While you are there, I would turn off the settings in the Product Improvement section (located underneath Significant Locations).\n\n   Go back to the Privacy page, scroll down to Analytics & Improvements, and make sure to disable Improve Siri & Diction. In the event that you accidentally enable Siri, you do not want your potentially sensitive conversation to be stored for review. Turn off the other analytics sections while you are there.\n\n    Go back to the Privacy page and go through each tab to see which permissions apps have granted access to (just as we did for the Location Services tab). Pay attention to Microphone, Camera, Photos, etc.\n\n    Finally go down to the bottom of the privacy page and tap on Apple advertising. From there, disable personalized ads.\n\n    As of the time of this writing, iOS 14.5 has not yet been released. In this update, apps will have to ask permission to track you through an identifier for advertisers (IDFA). Just say no when asked. Lastly, I would recommend going through all of your installed apps and removing the ones that you no longer use. They could be ;https://gizmodo.com/delete-most-of-your-apps-1845698368||tracking you in the background;. To learn more about the information each app collects, make sure to checkout the \";https://appleinsider.com/articles/20/12/10/how-to-read-apples-app-privacy-nutrition-labels-and-what-they-will-do-for-users||privacy nutrition labels;\" on each apps App Store page.",
    "androidRecommendations": "To be frank, Android isn’t great for privacy. I don’t expect most of you to empty your wallet and run to an iPhone or flash an alternate OS onto your phone so there are still some things you can do to improve Android privacy. ;https://ProtonMail.com/blog/android-privacy/||Here is an article on Android privacy;. Beware that recommendation #11 (using a non-Google version of Android) requires a user to be very tech savvy. Other than that the tutorial is pretty good. I would also go through any applications you have installed and remove those that you don’t use. This will free up space on your phone and prevent those applications from ;https://gizmodo.com/delete-most-of-your-apps-1845698368||tracking you in the background;.",
    "switchToAppleMaps": "As the name suggests, Apple Maps is the mapping application run by Apple and is installed on most Apple devices. Apple Maps works to protect your privacy and I use it personally. I find it gives good directions and works great as a navigator. I’d suggest using it over other maps applications if possible.\n\n    * Note, Apple Maps is only available on Apple devices at the time of this writing.",
    "switchToOsmAnd": "OsmAnd is a much less well known mapping application. However it does have a good privacy policy. In addition, the app does allow for offline storage of map data. This is good for going on a trip or something like that where you may lose data/connection. I have used OsmAnd on my Android devices and have found it to be pretty good. The app does have paid features but the free version is still good and should be fine for most users. The app is available for both Android and iOS. I highly recommend checking it out for Android users and iOS users if they don’t like Apple Maps. You can find it here: ;https://osmand.net/||osmand.net;. The Free version is called OsmAnd, the paid version is called OsmAnd+.",
    "alterGoogleMapsConfiguration": "If you really want to use Google Maps, which I would advise against, there are some changes you should make to the privacy settings. ;https://www.wired.co.uk/article/google-maps-privacy||Here is a Wired article on the subject;. You should also take a look at your ;https://www.consumerreports.org/privacy/how-to-use-google-privacy-settings/||Google privacy settings; if you haven’t already.",
    "alterWazeConfiguration": "If you really want to use Waze, which is owned by Google, you’ll probably want to take a look at ;https://www.consumerreports.org/privacy/how-to-use-google-privacy-settings/||this tutorial;. I’d also recommend you set Waze into invisible mode and disable ads personalization. ;https://support.google.com/waze/answer/7680098?hl=en||Here is a Google article on the adjusting Waze privacy;.",
    "transitionToProtonmail": "\bTLDR:; Create a ;https://protonmail.com/||ProtonMail; account, it's a great privacy focused, encrypted, email!;\n\n    As for email, I personally use ProtonMail. ProtonMail is an encrypted, privacy focused email service. Other providers can even be forced in court ;https://www.computerworld.com/article/2863378/court-reaffirms-think-before-you-email.html||to release emails;. ProtonMail on the other hand, ;https://protonmail.com/security-details||simply cannot do this; as they do not have access to your emails. I love ProtonMail for its privacy and security. There are also no ads built into their service. I have been successful in transitioning most of my email to ProtonMail. You can also setup an email forwarder and send emails from your previous email to ProtonMail if you want to help with the transition. The free tier is much less than that of the Gmail free tier, and offers 500mb of storage. I have actually been surprised at how much 500mb is, I haven’t even come close to that number yet for my email after using ProtonMail for 15 months. If you do decide to upgrade however, their paid tier is very affordable at $4 a month and allows you to use custom domains for your email! You’ll also be supporting a great service by doing so. They also have a VPN if you are interested. Check it out here ;https://protonmail.com/||protonmail.com; They have companion iOS and Android apps.",
    "alterGmailConfiguration": "While ProtonMail is the ideal email service for privacy. I still have not been able to move away from my original Gmail account and likely won't be able to for a while. Therefore you should alter your Google privacy settings. For Gmail privacy, I’d take a look at ;https://www.consumerreports.org/privacy/how-to-use-google-privacy-settings/||this tutorial;. It will apply to other Google products as well.",
    "alterYahooConfiguration": "Be sure to checkout ProtonMail! Its a great privacy focused service. In the meantime, in order to change Yahoo settings to be more privacy oriented, look at ;https://clark.com/technology/yahoo-mail-privacy-settings/||this article;. Be sure to Opt-Out of interest based advertising.",
    "alterOutlookConfiguration": "There isn’t much privacy-wise that can be changed in outlook. ;https://www.thewindowsclub.com/outlook-com-privacy-settings||Here is an article detailing some of the settings that you can change;.",
    "useSignal": "\bTLDR:; Signal is good for privacy. Use it.\n\n    Signal is a very well known encrypted messaging app. It is built by a nonprofit and is even used by Edward Snowden. Because Signal is so good at encrypted messaging, a lot of encrypted messaging apps such as WhatsApp even use the Signal encryption protocol. As Signal is run entirely by donations/grants, is open source, and is not owned by a data guzzling corporation like Facebook (who owns WhatsApp), Signal can be trusted not to violate their user's privacy. Signal is so good at protecting user's privacy that they even managed to hide the sender of each message from their own servers (;https://Signal.org/blog/sealed-sender/||if you are curious about the technical aspect;)! I would highly recommend its use when possible. Signal also has a disappearing messages feature so that the messages get deleted x amount of time after being viewed. Check it out at ;https://www.Signal.org/||Signal.org; or find it in the App Store/Google Play. It is the gold standard for encrypted messaging and is definitely worth checking out.",
    "neverSendPrivateOverSMS": "SMS or generic text messaging is a very insecure way of communicating. The messages aren’t encrypted and are a privacy nightmare. Although there are times when using SMS is unavoidable, I would highly advise against its use especially when sending private information. If you are using SMS for 2FA (2 factor authentication), I’d recommend using an ;https://www.cloudwards.net/best-2fa-apps/||authenticator app; in its place. This is because new types of SMS attacks (hacking) are constantly being discovered. Here is an article on why ;https://www.forbes.com/sites/kateoflahertyuk/2020/01/21/the-surprising-truth-about-sms-security/||SMS is bad for 2FA;. Another SMS exploit was also recently reported ;https://www.theverge.com/2021/3/15/22332315/sms-redirect-flaw-exploit-text-message-hijacking-hacking||here;. In short, avoid SMS when possible and definitely never send private info over SMS.",
    "alterFBDMConfiguration": "If you are set on using Facebook Messenger/Instagram DMs (;https://www.macrumors.com/2020/09/30/facebook-unifies-messenger-and-instagram/||they are the same thing now;) you will want to use their “secret” messaging feature. Secret messaging simply means that the contents of the conversation are now encrypted. This title is misleading however and Facebook will continue to collect gargantuan amounts of data on you and the conversation, just not the contents of that conversation. I’d still suggest that you switch to Signal when possible, iMessage, or even WhatsApp (also owned by Facebook) over Facebook Messenger/Instagram DMs. After that, check up on your ;https://www.techlicious.com/tip/complete-guide-to-facebook-privacy-settings/||Facebook privacy settings;. Especially take a look at the part of the article discussing “Off-Facebook Activity”.",
    "alterWhatsAppConfiguration": "I would use Signal over WhatsApp but sometimes it isn’t avoidable. ;https://www.forbes.com/sites/blakemorgan/2021/01/14/whatsapp-controversy-shows-just-how-much-privacy-matters-to-customers/||The recent controversy; with Facebook data collection caused public outrage and shows the app ;https://www.forbes.com/sites/zakdoffman/2021/03/06/stop-using-whatsapp-after-facebook-apple-imessage-signal-and-telegram-privacy-backlash/||cannot really be trusted;.There are some settings that you should review when it comes to WhatsApp. ;https://www.fastcompany.com/90388813/the-ultimate-guide-to-whatsapps-powerful-privacy-options||Check out this guide for further;. Facebook will of course still collect data so this isn’t ideal.",
    "alterTelegramConfiguration": "I would still definitely recommend Signal over Telegram. If you do use Telegram, I would try to use secret chats as much as possible to enable end to end encryption. Telegrams privacy is not as great as it seems. ;https://www.wired.com/story/telegram-encryption-whatsapp-settings/||More about Telegram encryption and why Signal is better;. If you have the option, always use Signal.",
    "neverSendPrivateOverDiscord": "Discord is an extremely convenient chat application. However, none of the conversations in Discord are end to end encrypted meaning that Discord, or a hacker, could gain access to your chat history. I would recommend never sharing private/confidential information over Discord. I would therefore highly recommend using Signal over Discord for private messaging (Signal does have a group chat feature, but it's nowhere near as feature rich as Discord servers.) Also, Microsoft is apparently trying to ;https://www.bloomberg.com/news/articles/2021-03-23/microsoft-said-to-be-in-talks-to-buy-discord-for-more-than-10b||acquire Discord;. In the event that this happens, be aware that Discord's privacy policy will likely change for the worse. If you are interested in an alternative, and are in charge of a large team, you could check out a program called ;https://mattermost.com/||Mattermost;. However, Mattermost is more like Slack than Discord. It isn’t super practical for the average user.",
    "deleteFacebook": "It is no secret that Facebook has abysmal privacy practices. For years upon years Facebook has eroded the trust of their users, and violated their privacy. A quick search results in an insane amount of privacy controversies for the company and their blatant disregard for their users. I would advocate for the deletion of Facebook. ;https://www.nbcnews.com/tech/social-media/timeline-facebook-s-privacy-issues-its-responses-n859651||NBC actually made a timeline on some of their privacy controversies here;. If you want to delete Facebook, ;https://www.howtogeek.com/550024/how-to-delete-your-facebook-account/||here is a tutorial;. However, I understand that this isn’t always an option for some people so checkout the less ideal recommendations below.",
    "deleteInstagram": "Instagram is owned by Facebook and is an extremely invasive platform. ;https://www.independent.co.uk/life-style/gadgets-and-tech/instagram-invasive-app-privacy-facebook-b1818453.html||Check out this article from the independent on how invasive Instagram is;. I really like the Social Dilemma by Netflix as it does a good job of discussing how the ;https://www.nngroup.com/articles/attention-economy/||attention economy; works. It is no secret that Facebook has abysmal privacy practices. For years upon years Facebook has eroded the trust of their users, and violated their privacy. A quick search results in an insane amount of privacy controversies for the company and their blatant disregard for their users. I would advocate for the deletion of Instagram. ;https://www.nbcnews.com/tech/social-media/timeline-facebook-s-privacy-issues-its-responses-n859651||NBC actually made a timeline on some of their privacy controversies here;. If you want to delete Instagram, ;https://www.msn.com/en-us/news/technology/how-to-delete-your-instagram-account-permanently-or-temporarily-deactivate-it/ar-BB14JSV1||here is a tutorial;.",
    "alterFacebookConfiguration": "If you continue to use Facebook, it is not going to magically respect your privacy. However there are some things you can do to improve your Facebook privacy. ;https://www.consumerreports.org/privacy/facebook-privacy-settings/||Check out this tutorial on the subject;. If you are on iOS (iPhone) you will also be able to opt out of some tracking soon (you will still be tracked, just less so). Beware of ;https://9to5mac.com/2021/03/11/former-facebook-employees-detail-how-ios-14-privacy-features-are-affecting-the-company/||this deceptive alert; that will appear in the Facebook app. Of course ask app not to track.",
    "firefoxFacebookContainer": "A nice extension for Firefox is called the FacebookContainer. Basically it quarantines the Facebook website to make it more difficult for Facebook to track you across the web. If you are a Firefox user (Firefox is highly recommended for privacy purposes), you can ;https://addons.mozilla.org/en-US/firefox/addon/facebook-container/||install it here; or search for Facebook Container on ;https://addons.mozilla.org/en-US/firefox/addon/facebook-container/||addons.mozilla.org;",
    "alterInstagramConfiguration": "Make sure to have your account set to private and to remove any followers you do not know. There are plenty of bots and webscrapers which would love to take your data (separate from Instagram/Facebook). ;https://www.marketwatch.com/story/facial-recognition-company-clearview-ai-sued-by-california-activists-01615344732||Here is an article on an extremely invasive and arguably unethical facial recognition company called ClearviewAI doing just that;.",
    "neverSendPrivateOverSnapchat": "Snapchat often advertises its chats as being private. However their chats are NOT end to end encrypted and can be viewed by Snapchat itself. I would never send private/confidential information over Snapchat. For that, use Signal.",
    "alterSnapchatConfiguration": "For Snapchat privacy, I would disable the Location/Location Services permission in the iOS or Android settings apps. Snapchat doesn’t need to see your location and the Snap Map feature is horrible for privacy. ;https://social.techjunkie.com/disable-snapmap-privacy-snapchat/||Here is how to disable it;.  I would also make sure that you know everyone you are connected to. This way, the stories you make don’t fall into the wrong hands.",
    "alterLinkedInConfiguration": "I would change a couple of things about LinkedIn. First I would go to ;https://www.linkedin.com/psettings/advertising/demographics||Settings -> Advertising Data; and go and adjust the various settings to improve privacy (basically turn them all off).\n\n    Then go back to settings, click on visibility, and then go to ;https://www.linkedin.com/public-profile/settings||\"edit your public profile\";. I would at least change your profile photo to “All LinkedInMembers” or “Your network” to make it more difficult for bots to scrape your data. For the rest of the profile, choose what you want to be public.\n\n    Finally, by default other users can see when you view their profile. If this bothers you, you can go to ;https://www.linkedin.com/psettings/profile-visibility||settings -> visibility -> profile viewing options; and set your account to private mode.",
    "deleteTikTok": "I would highly recommend deleting TikTok. The company repeatedly shows that it is willing to go above and beyond to collect data on its users. Last year, it was discovered that TikTok had been;https://www.theverge.com/2020/8/11/21364017/tiktok-mac-address-collected-identifier-android-violation|| using a loophole; to collect MAC addresses (basically an ID number) on Android which they knew was against the Google Play terms of service. TikTok was ;https://www.macrumors.com/2020/06/25/tiktok-clipboard-access-ios-14-caught/||caught accessing the clipboard; (copy/paste info) repeatedly on iOS devices last year. It recently settled a ;https://blog.malwarebytes.com/reports/2021/02/tiktok-pays-92-million-to-end-data-theft-lawsuit/||$92 million dollar lawsuit; for data theft. If you care at all about your privacy or security, delete TikTok! There are also concerns that TikTok is used to spy on the citizens of other countries. This info could be used in the future to manipulate elections, sow political discord etc. Here is how to ;https://www.wikihow.com/Delete-a-TikTok-Account||delete TikTok;.",
    "alterTwitterConfiguration": "Twitter privacy isn’t very good, but there are some settings which can help you improve it.\n\n    If you are using the Twitter ;\bwebsite;, go to ;https://twitter.com/settings/privacy_and_safety||twitter.com/settings/privacy_and_safety; (note, you need to be logged in to access that link). Scroll down to \"Data sharing and off-Twitter activity\" and go through each tab (Off-Twitter activity, Data sharing with business partners, and Location information). Explore each tab and disable all of the settings.\n\n    If you are using the ;\bapp;, tap the three bars in the top left -> Settings and privacy -> Privacy and safety. From there, scroll down and disable \"Precise location\". Below \"Precise location\" in the Privacy and safety page you will find \"Personalization and data\". Turn off \"Personalization and data\".\n\n    You can also make your profile private if you want. By default all Twitter tweets are public and can be scraped up by bots outside of Twitter. Here is an article on ;https://www.fightingidentitycrimes.com/how-to-adjust-your-twitter-privacy-settings/||how to make your profile private;.",
    "alterVerizonConfiguration": "Go check out your Verizon privacy settings. To access the Verizon privacy dashboard go here ;https://www.verizon.com/privacy/your-data||verizon.com/privacy/your-data;.",
    "alterATTConfiguration": "To access the AT&T privacy dashboard go here ;https://www.att.com/support/article/wireless/KM1153372||att.com/support/article/wireless/KM1153372;.",
    "alterTMobileConfiguration": "T-Mobile is implementing a fairly invasive policy soon that requires their users to explicitly opt out of having their data shared with advertisers! ;https://www.theverge.com/2021/3/9/22321733/t-mobile-privacy-policy-third-party-advertisers||Here is an article on the subject;.",
    "lookOverCarrierPrivacy": "Be sure to look over your carrier's privacy settings on their app/website. T-Mobile is going to start sharing user data with advertisers unless users opt out so be on the lookout for tactics like that.",
    "getAPasswordManager": "\bTLDR:; Use a password manager. They are much more secure than memorizing passwords and are very convenient;\n\n    While memorizing passwords may seem like the more secure, privacy focused option, it's not. Typically, when someone memorizes passwords they do two things that are horrible for security purposes.\n\n   First thing is that they use the same passwords for multiple sites. In the likely event that one of those sites gets hacked, hackers will then try the password across many other accounts! This even happened to my Microsoft account a couple years ago. Check if any of your passwords are floating around in known databases here: ;https://monitor.firefox.com/||monitor.firefox.com;. You will be surprised!\n\n    The second thing people do is use very simple patterns such as words as their passwords.  Both of these problems are solvable using a password manager. A password manager is a program that securely stores and randomly generates all of your passwords. Using a password manager, you will have no duplicate or insecure passwords. Password managers work by having you use a single strong password (called a master password) to encrypt all of your other passwords. I highly recommend using one, if you don’t, you are at extreme risk of being hacked. It is also a pain to remember passwords :). Using a password manager, you only have to remember one password! ;https://www.mozilla.org/en-US/firefox/lockwise/||Firefox Lockwise; is a good free password manager. I personally use LastPass Premium, but that is a subscription service (note, if you choose to use LastPass, ;https://www.forbes.com/sites/daveywinder/2021/02/27/how-to-stop-lastpass-tracking-you-in-3-easy-steps/||disable analytics;). Here is a PCMag article on their ;https://www.pcmag.com/picks/the-best-password-managers||top password manager choices;.",
    "aboutFirefox": "Firefox is a web browser",
    "todoAbout": "This is an unfilled about. I have not made it yet. I'm still supposed to make it. It will be done. REMOVE ME BEFORE PUBLISHING",
    "nordVPNAffiliate": "This is the NordVPN affiliate link. add more later."
 }